{
  "backend/main.mo": "Actor managing order creation and retrieval with access control, storing orders in a map and enforcing user permissions.",
  "backend/migration.mo": "Migration module that initializes an empty orders map and resets nextOrderId for new deployments.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files for reference.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React layout composing header, sections, footer, and toaster for notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with query cache clearing.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying copyright info and a caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, login button, and cart button for desktop and mobile.",
  "frontend/src/components/menu/MenuFilters.tsx": "Filter bar allowing search and veg/non‑veg toggles with clear‑filters support.",
  "frontend/src/components/menu/MenuItemCard.tsx": "Menu item card showing details, spice level, and an add‑to‑cart action with toast feedback.",
  "frontend/src/components/menu/MenuSection.tsx": "Renders the menu with category tabs, filters, and item cards, showing an empty state when no items match.",
  "frontend/src/components/order/CartButton.tsx": "Displays a cart button with item count badge and opens the cart sheet.",
  "frontend/src/components/order/CartSheet.tsx": "Shows cart contents with quantity controls, subtotal, and checkout flow, or an empty state if no items.",
  "frontend/src/components/order/CheckoutDialog.tsx": "Handles order checkout, form validation, order submission, and shows confirmation on success.",
  "frontend/src/components/order/OrderConfirmation.tsx": "Displays a confirmation screen with order ID and timestamp after successful checkout.",
  "frontend/src/components/orders/MyOrdersSection.tsx": "Shows user's past orders with loading, error, and empty states, requiring authentication.",
  "frontend/src/components/sections/AboutSection.tsx": "Presents an overview of the restaurant with feature cards highlighting its qualities.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact info including phone, service area, and business hours.",
  "frontend/src/components/sections/HeroSection.tsx": "A hero section displaying business info, call-to-action buttons, and a hero image with smooth scroll-to-menu behavior.",
  "frontend/src/config/business.ts": "Exports static business details including name, tagline, description, contact info, and operating hours.",
  "frontend/src/data/menu.ts": "Defines MenuItem type and provides menu categories and a large list of predefined menu items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useCallerOrders.ts": "Fetches caller-specific orders using the backend actor, enabled only when the actor is ready.",
  "frontend/src/hooks/useCart.ts": "Zustand store managing cart items with persistence and helpers for subtotal and item counts.",
  "frontend/src/hooks/useCreateOrder.ts": "Mutation hook that formats cart items, creates an order via the actor, clears the cart, and refreshes order data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity login, storage, and status handling.",
  "frontend/src/hooks/useMenuFiltering.ts": "Implements search and veg/non-veg filters for menu items using local state and memoized filtering.",
  "frontend/src/index.css": "Tailwind CSS base with custom color variables and themes for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/money.ts": "Utility for INR formatting and converting numbers to bigint for backend usage.",
  "frontend/src/utils/orderMeta.ts": "Handles saving and retrieving simple order metadata in localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins.",
  "project_state.json": "Stores the project’s state, version, feature list, and metadata for a cloud‑kitchen website."
}