{
  "kind": "build_request",
  "title": "Add online ordering (cart + checkout + order history) to the cloud kitchen website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add an online ordering UI that lets users add menu items to a cart from the menu, adjust quantities, remove items, clear the cart, and see an order subtotal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Your app is ready — want to add online ordering as a next step?",
          "yes please add"
        ]
      },
      "acceptanceCriteria": [
        "Each MenuItemCard provides an obvious control to add the item to the cart.",
        "Cart UI shows line items with: item name, unit price, quantity controls, line total, and remove action.",
        "Cart UI shows subtotal and a clear-cart action.",
        "Cart persists at least for the current browser session (page reload) OR clearly resets and informs the user (choose one behavior and implement consistently).",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a checkout flow that collects order details (order type, customer info, delivery address when applicable, and optional special instructions) and validates required fields before allowing submission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Your app is ready — want to add online ordering as a next step?",
          "yes please add"
        ]
      },
      "acceptanceCriteria": [
        "Checkout is reachable from the cart and displays a clear order summary (items, quantities, subtotal).",
        "Checkout form includes: order type (Pickup/Delivery), customer name, phone number, and delivery address fields that are required only when Delivery is selected, plus optional special instructions.",
        "Submit is disabled or shows inline validation errors until required fields are provided.",
        "After a successful submission, the UI shows an order confirmation state that includes a unique order identifier and a timestamp.",
        "If submission fails, the UI shows a readable error message and keeps the cart/inputs intact."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Implement backend order storage and APIs to create an order and retrieve orders for the currently authenticated caller (Internet Identity principal).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Your app is ready — want to add online ordering as a next step?",
          "yes please add"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo defines stable data structures to persist orders across canister upgrades.",
        "Backend exposes a create-order method that accepts: cart items (menu item id, name, unit price, quantity), order type (Pickup/Delivery), customer name, phone, optional address, optional instructions, and computes/stores totals server-side.",
        "Backend exposes a method to list orders for the calling principal (e.g., most recent first).",
        "Backend returns a unique order id for each created order.",
        "Anonymous callers are either rejected with a clear error OR allowed but attributed consistently (pick one approach and implement consistently)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Connect the new checkout UI to the backend using the existing actor/React Query setup, and add a 'My Orders' view that shows the authenticated user’s submitted orders.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Your app is ready — want to add online ordering as a next step?",
          "yes please add"
        ]
      },
      "acceptanceCriteria": [
        "Frontend uses the existing useActor hook to call backend order APIs.",
        "Order creation is implemented as a React Query mutation with loading state and error handling.",
        "After successful order creation, the cart is cleared and 'My Orders' reflects the new order (via query invalidation/refetch).",
        "A 'My Orders' section or page is accessible from the existing site navigation and displays a list of orders with: order id, date/time, status (at least 'Placed'), item count, and total amount.",
        "All user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state migration is truly required.",
    "Do not edit files under frontend/src/components/ui or other paths listed in frontend.immutablePaths; compose existing UI components instead.",
    "Do not route or serve images from the backend; keep static assets under frontend/public/assets/generated."
  ],
  "nonGoals": [
    "Online payment processing (e.g., card/UPI/Stripe) and payment settlement.",
    "Real-time order tracking, notifications, SMS/WhatsApp updates, or live chat.",
    "Integration with third-party delivery providers or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}